       IDENTIFICATION DIVISION.
       PROGRAM-ID.  PROJE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL
           SELECT SOFOROKU ASSIGN TO DISK
             ORGANIZATION INDEXED ACCESS DYNAMIC
             RECORD KEY ANAHTAR
             FILE STATUS  FST.
           SELECT YAZICI ASSIGN TO PRINTER ORGANIZATION SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD SOFOROKU LABEL RECORD STANDARD
                   VALUE OF FILE-ID "KAYIT.".
            01 KAYIT.
              02 AD        PIC X(20).
              02 YER       PIC X(15).
              02 NUMARA    PIC 9(8).
              02 BTAR.
                03 GUN     PIC X(2).
                03 AY      PIC X(2).
                03 YIL     PIC X(2).
              02 DTAR      PIC X(10).
              02 TOPLAM    PIC 9(12).
       FD YAZICI LABEL RECORD OMITTED.
          01 SATIR       PIC X(80).
       WORKING-STORAGE SECTION.
       77 FST     PIC XX.
       77 TUS     PIC X.
       77 CIZGI   PIC X(80) VALUE ALL "=".
       77 TARIH   PIC XX/XX/XX.
       77 S       PIC 9.
       77 SENE    PIC 99.
       77 YENI    PIC 9(12).
       01 SECIM   PIC XX.
         88 GIR   VALUE "02".
         88 ARA   VALUE "03".
         88 YLIST VALUE "05".
         88 ELIST VALUE "04".
         88 DUZ   VALUE "06".
         88 TLIST VALUE "07".
         88 ODE   VALUE "08".
         88 CIK   VALUE "01".
       01 BASLIK.
         02 FILLER PIC X(10) VALUE "SIGORTA NO".
         02 FILLER PIC X(5)  VALUE SPACES.
         02 FILLER PIC X(10) VALUE "ADI SOYADI".
         02 FILLER PIC X(15) VALUE SPACES.
         02 FILLER PIC X(10) VALUE "B. TARIHI ".
         02 FILLER PIC X(5)  VALUE SPACES.
         02 FILLER PIC X(12) VALUE "PRIM TOPLAMI".
         02 FILLER PIC X(23) VALUE SPACES.
       01 YAZ.
         02 SAYI     PIC 9(8).
         02 FILLER   PIC X(7) VALUE SPACES.
         02 ADI      PIC X(20).
         02 FILLER   PIC X(5) VALUE SPACES.
         02 BAS      PIC ZZ/ZZ/ZZ.
         02 FILLER   PIC X(14).
         02 PRIM     PIC ZZZ,ZZZ,ZZZ,ZZZ.
         02 FILLER   PIC X(3) VALUE SPACES.
       SCREEN SECTION.
       01 ANA-MENU.
         02 BLANK SCREEN.
         02 LINE 8 COLUMN 25 VALUE " F1=DOSYAYA KAYIT " REVERSE-VIDEO.
         02 LINE 9 COLUMN 25 VALUE " F2=KAYIT ARAMA   " REVERSE-VIDEO.
         02 LINE 10 COLUMN 25 VALUE " F3=EKRANA LISTE  " REVERSE-VIDEO.
         02 LINE 11 COLUMN 25 VALUE " F4=YAZICIYA LISTE" REVERSE-VIDEO.
         02 LINE 12 COLUMN 25 VALUE " F5=KAYIT DUZELTME" REVERSE-VIDEO.
         02 LINE 13 COLUMN 25 VALUE " F6=YILLIK LISTE  " REVERSE-VIDEO.
         02 LINE 14 COLUMN 25 VALUE " F7=PRIM ODEME    " REVERSE-VIDEO.
         02 LINE 15 COLUMN 25 VALUE "ESC=PROGRAM SONU  " REVERSE-VIDEO.
         02 LINE 16 COLUMN 25 VALUE "SECIMINIZ........." REVERSE-VIDEO.
       01 KAYIT-GIRISI.
         02 BLANK SCREEN.
         02 LINE 11 COLUMN 20 VALUE "   SIGORTALININ " REVERSE-VIDEO.
         02 LINE 12 COLUMN 20 VALUE " ADI SOYADI    =" REVERSE-VIDEO.
         02 LINE 13 COLUMN 20 VALUE " DOGUM YERI    =" REVERSE-VIDEO.
         02 LINE 14 COLUMN 20 VALUE " DOGUM TARIHI  =" REVERSE-VIDEO.
         02 LINE 15 COLUMN 20 VALUE " BASLAMA TARIHI=" REVERSE-VIDEO.
         02 LINE 16 COLUMN 20 VALUE " SIGORTA NO    =" REVERSE-VIDEO.
         02 LINE 17 COLUMN 20 VALUE " PRIM MIKTARI  =" REVERSE-VIDEO.
       01 TEKRAR-EKRANI.
         02 LINE 20 COLUMN 20 VALUE "T" HIGHLIGHT.
         02 LINE 20 COLUMN 21 VALUE "EKRAR" .
         02 LINE 20 COLUMN 28 VALUE "M" HIGHLIGHT.
         02 LINE 20 COLUMN 29 VALUE "ENU" .
       01 KAYIT-ARAMA.
         02 BLANK SCREEN.
         02 LINE 10 COLUMN 20 VALUE "SIGORTA NO    =" REVERSE-VIDEO.
       01 ARANAN.
         02 LINE 11 COLUMN 20 VALUE "ADI SOYADI    =" HIGHLIGHT.
         02 LINE 12 COLUMN 20 VALUE "DOGUM YERI    =" HIGHLIGHT.
         02 LINE 13 COLUMN 20 VALUE "DOGUM TARIHI  =" HIGHLIGHT.
         02 LINE 14 COLUMN 20 VALUE "BASLAMA TARIHI=" HIGHLIGHT.
         02 LINE 15 COLUMN 20 VALUE "PRIM TOPLAMI  =" HIGHLIGHT.
         02 LINE 18 COLUMN 20 VALUE "BIR TUSA BASINIZ." REVERSE-VIDEO.
       01 EKRANA-LISTE.
         02 BLANK SCREEN.
         02 LINE 1 COLUMN 1 VALUE "SIGORTA NO".
         02 LINE 1 COLUMN 15 VALUE "ADI SOYADI".
         02 LINE 1 COLUMN 35 VALUE "B. TARIHI".
         02 LINE 1 COLUMN 45 VALUE "PRIM TOPLAMI".
         02 LINE 1 COLUMN 60 VALUE "DOGUM YERI".
       01 DUZELTME.
         02 LINE 11 COLUMN 20 VALUE "1-ADI SOYADI    =" REVERSE-VIDEO.
         02 LINE 12 COLUMN 20 VALUE "2-DOGUM YERI    =" REVERSE-VIDEO.
         02 LINE 13 COLUMN 20 VALUE "3-DOGUM TARIHI  =" REVERSE-VIDEO.
         02 LINE 14 COLUMN 20 VALUE "4-BASLAMA TARIHI=" REVERSE-VIDEO.
         02 LINE 15 COLUMN 20 VALUE "5-PRIM TOPLAMI  =" REVERSE-VIDEO.
         02 LINE 16 COLUMN 20 VALUE
          "DUZELTILECEK KAYITNUMARASINI GIRIN" HIGHLIGHT.
       01 YILLIK-LISTE.
         02 LINE 12 COLUMN 30 VALUE
         "LISTELENECEK YIL=" REVERSE-VIDEO.
       PROCEDURE DIVISION.
       BASLA.
           OPEN I-O SIGORTA.
           IF FST = "30" OPEN OUTPUT SIGORTA CLOSE SIGORTA
           OPEN I-O SIGORTA.
           OPEN OUTPUT YAZICI.
       MENU.
           DISPLAY ANA-MENU.
           ACCEPT(16, 43) TUS.
           ACCEPT SECIM FROM ESCAPE KEY.
           IF GIR GO KAYITI.
           IF ARA GO ARAMA.
           IF ELIST GO EKRAN.
           IF DUZ GO DUZELT.
           IF CIK GO CIKIS.
           IF YLIST GO YAZI.
           IF TLIST GO YILLIK.
           IF ODE GO ODEME.
       CIKIS.
           CLOSE SIGORTA YAZICI.
           DISPLAY(1, 1) ERASE.
           STOP RUN.
       KAYITI.
           DISPLAY KAYIT-GIRISI.
           ACCEPT(12, 36) AD WITH PROMPT.
           ACCEPT(13, 36) YER WITH PROMPT.
           ACCEPT(16, 36) NUMARA WITH PROMPT.
           ACCEPT(15, 36) GUN WITH PROMPT.
           ACCEPT(15, 38) AY WITH PROMPT.
           ACCEPT(15, 40) YIL WITH PROMPT.
           ACCEPT(14, 36) DTAR WITH PROMPT.
           ACCEPT(17, 36) TOPLAM WITH PROMPT.
           WRITE KAYIT INVALID KEY DISPLAY(18, 20) "CIFT KAYIT"
           GO TEN.
       TEN.
           DISPLAY TEKRAR-EKRANI.
           ACCEPT(20, 34) TUS WITH AUTO-SKIP.
           IF TUS = "M" GO MENU.
           IF TUS = "T" GO KAYITI.
           GO TEN.
       ARAMA.
           DISPLAY KAYIT-ARAMA.
           ACCEPT(10, 35) NUMARA WITH PROMPT.
           READ SIGORTA INVALID KEY DISPLAY(18, 20) "KAYIT BULUNAMADI"
           ACCEPT (18, 40) TUS WITH PROMPT  GO MENU.
           DISPLAY ARANAN.
           DISPLAY(11, 35) AD.
           DISPLAY(12, 35) YER.
           DISPLAY(13, 35) DTAR.
           MOVE BTAR TO TARIH.
           DISPLAY(14, 35) TARIH.
           DISPLAY(15, 35) TOPLAM.
           ACCEPT(18, 39) TUS WITH AUTO-SKIP.
           GO MENU.
       EKRAN.
           MOVE ZERO TO NUMARA.
           START SIGORTA KEY IS NOT LESS NUMARA
              INVALID KEY DISPLAY(18, 20) "KAYIT YOK" GO MENU.
       LISTE.
           DISPLAY EKRANA-LISTE.
           DISPLAY(2, 1) CIZGI.
           MOVE 3 TO LIN.
       OKU.
           READ SIGORTA NEXT AT END GO SON.
           MOVE BTAR TO TARIH.
           DISPLAY(LIN, 1) NUMARA.
           DISPLAY(LIN, 15) AD.
           DISPLAY(LIN, 35) TARIH.
           DISPLAY(LIN, 45) TOPLAM.
           DISPLAY(LIN, 60) YER.
           ADD 1 TO LIN.
           IF LIN NOT = 22 GO OKU.
           DISPLAY(24, 1)
           "SAYFA DOLDU.DIGER SAYFA ICIN BIR TUSA BASINIZ.".
           ACCEPT(24, 47) TUS WITH AUTO-SKIP.
           GO LISTE.
       SON.
           DISPLAY(24, 1)
           "LISTELEME SONA ERDI.MENUYE DONMEK ICIN BIR TUSA BASINIZ".
           ACCEPT(24, 60) TUS WITH AUTO-SKIP.
           GO MENU.
       DUZELT.
           DISPLAY KAYIT-ARAMA.
           ACCEPT(10, 35) NUMARA WITH PROMPT.
           READ SIGORTA INVALID KEY DISPLAY(18, 20) "KAYIT BULUNAMADI"
           ACCEPT (18, 40) TUS WITH PROMPT  GO MENU.
       DUZEL.
           DISPLAY DUZELTME.
           DISPLAY(11, 35) AD.
           DISPLAY(12, 35) YER.
           DISPLAY(13, 35) DTAR.
           MOVE BTAR TO TARIH.
           DISPLAY(14, 35) TARIH.
           DISPLAY(15, 35) TOPLAM.
           ACCEPT(16, 44) S WITH AUTO-SKIP.
           IF S = 1 PERFORM D1 GO DUZEL.
           IF S = 2 PERFORM D2 GO DUZEL.
           IF S = 3 PERFORM D3 GO DUZEL.
           IF S = 4 PERFORM D4 GO DUZEL.
           IF S = 5 PERFORM D5 GO DUZEL.
           IF S = 9 REWRITE KAYIT INVALID KEY
           DISPLAY(24, 20) "DISKETE YAZAMIYORUM".
           ACCEPT(18, 39) TUS WITH AUTO-SKIP.
           GO MENU.
       D1.
           DISPLAY(11, 35) "                    ".
           ACCEPT(11, 35) AD WITH PROMPT.
       D2.
           DISPLAY(12, 35) "               ".
           ACCEPT(12, 35) YER WITH PROMPT.
       D3.
           DISPLAY(13, 35) "          ".
           ACCEPT(13, 35) DTAR WITH PROMPT.
       D4.
           DISPLAY(14, 35) "  ".
           ACCEPT(14, 35) GUN WITH PROMPT.
           DISPLAY(14, 37) "  ".
           ACCEPT(14, 37) AY WITH PROMPT.
           DISPLAY(14, 39) "  ".
           ACCEPT(14, 39) YIL WITH PROMPT.
       D5.
           DISPLAY(15, 35) "            ".
           ACCEPT(15, 35) TOPLAM WITH PROMPT.
       YAZI.
           DISPLAY(1, 1) ERASE.
           MOVE ZERO TO NUMARA.
           START SIGORTA KEY IS NOT LESS NUMARA INVALID KEY
             DISPLAY(12, 20) "DOSYA BOS.BIR TUSA BAS."
             ACCEPT(12, 43) TUS WITH AUTO-SKIP GO MENU.
           WRITE SATIR FROM BASLIK.
           WRITE SATIR FROM CIZGI.
       OKUMA.
           READ SIGORTA NEXT AT END
             DISPLAY(1, 1) ERASE
             DISPLAY(12, 20) "DOSYA BITTI.BIR TUSA BAS."
             ACCEPT(12, 47) TUS WITH AUTO-SKIP GO MENU.
           MOVE NUMARA TO SAYI.
           MOVE AD TO ADI.
           MOVE BTAR TO BAS.
           MOVE TOPLAM TO PRIM.
           WRITE SATIR FROM YAZ.
           GO OKUMA.
       YILLIK.
           DISPLAY(1, 1) ERASE.
           DISPLAY YILLIK-LISTE.
           ACCEPT(12, 48) SENE WITH PROMPT.
           IF SENE = 00 GO YILLIK.
           MOVE ZERO TO NUMARA.
           START SIGORTA KEY IS NUMARA INVALID KEY
             DISPLAY(16, 20) "DOSYA BOS.BIR TUSA BAS."
              ACCEPT(16, 44) TUS WITH AUTO-SKIP GO MENU.
       BASLIK-AT.
           DISPLAY EKRANA-LISTE.
           DISPLAY(2, 1) CIZGI.
           MOVE 3 TO LIN.
       OKUL.
           READ SIGORTA NEXT AT END GO BEKLE.
           IF YIL NOT = SENE GO OKUL.
           MOVE BTAR TO TARIH.
           DISPLAY(LIN, 1) NUMARA.
           DISPLAY(LIN, 15) AD.
           DISPLAY(LIN, 35) TARIH.
           DISPLAY(LIN, 45) TOPLAM.
           DISPLAY(LIN, 60) YER.
           ADD 1 TO LIN.
           IF LIN NOT = 22 GO OKU.
           DISPLAY(24, 1)
           "SAYFA DOLDU.DIGER SAYFA ICIN BIR TUSA BASINIZ.".
           ACCEPT(24, 46) TUS WITH AUTO-SKIP.
           GO BASLIK-AT.
       BEKLE.
           DISPLAY(24, 1)
            "KAYIT BITTI.MEUYE DONMEK ICIN BIR TUSA BASINIZ.".
            ACCEPT(24, 45) TUS WITH PROMPT.
           GO MENU.
       ODEME.
           DISPLAY KAYIT-ARAMA.
           ACCEPT(10, 35) NUMARA WITH PROMPT.
           READ SIGORTA INVALID KEY DISPLAY(18, 20) "KAYIT BULUNAMADI"
           ACCEPT (18, 40) TUS WITH PROMPT  GO MENU.
           DISPLAY ARANAN.
           DISPLAY(11, 35) AD.
           DISPLAY(12, 35) YER.
           DISPLAY(13, 35) DTAR.
           MOVE BTAR TO TARIH.
           DISPLAY(14, 35) TARIH.
           DISPLAY(15, 35) TOPLAM.
           DISPLAY(16, 20) "ODEDIGI MIKTAR=".
           ACCEPT(16, 36) YENI WITH PROMPT.
           COMPUTE TOPLAM = YENI + TOPLAM.
           REWRITE KAYIT INVALID KEY
             DISPLAY(24, 20) "DISKETE YAZAMIYORUM".
       DEVAMMI.
           DISPLAY(18, 20) "DEVAM E/H".
           ACCEPT(18, 29) TUS WITH AUTO-SKIP.
           IF TUS = "E" GO ODEME.
           GO MENU.