       IDENTIFICATION DIVISION.
       PROGRAM-ID.  PROJE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL
           SELECT SOFOROKU ASSIGN TO DISK
             ORGANIZATION INDEXED ACCESS DYNAMIC
             RECORD KEY ANAHTAR
             FILE STATUS  FST.
           SELECT YAZICI ASSIGN TO PRINTER ORGANIZATION SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD SOFOROKU LABEL RECORD STANDARD
                   VALUE OF FILE-ID "KAYIT.".
            01 KAYIT.
              02 NUMARA    PIC 9(4).
              02 ISIM      PIC X(20).
              02 SNO       PIC 9(2).
              02 SAYNO     PIC 9(2).
              02 BADI      PIC X(12).
              02 AADI      PIC X(12).
              02 DYERI     PIC X(10).
              02 DTAR      PIC X(10).
              02 ILI       PIC X(10).
              02 ILCE      PIC X(10).
              02 KMAH      PIC X(12).
              02 CNO       PIC 9(4).
              02 EVADR     PIC X(20).
              02 EVTEL     PIC Z(9).
              02 VTAR      PIC X(10).
              02 VNUFID    PIC X(10).
              02 DIGBIL.
                 03 TAHDUR PIC X(4).
                 03 DRAP   PIC X(8).
                 03 ONBELC PIC X(6).
                 03 ISBELC PIC X(6).
              02 ODEME     PIC 9(4).
              02 ISADR     PIC X(20).
              02 ISTEL     PIC Z(9).
       FD YAZICI LABEL RECORD OMITTED.
          01 SATIR       PIC X(80).
       WORKING-STORAGE SECTION.
       77 FST     PIC XX.
       77 TUS     PIC X.
       77 CIZGI   PIC X(80) VALUE ALL "=".
       77 TARIH   PIC XX/XX/XX.
       77 S       PIC 9.
       77 SENE    PIC 99.
       77 YENI    PIC 9(12).
       SCREEN SECTION.
       01 ANA-MENU.
         02 BLANK SCREEN.
         02 LINE 8 COLUMN 25 VALUE "  1 GIRIS                "
          REVERSE-VIDEO.
         02 LINE 9 COLUMN 25 VALUE "  2 KAYIT OKUMA          "
          REVERSE-VIDEO.
         02 LINE 10 COLUMN 25 VALUE "  3 LISTELEME            "
          REVERSE-VIDEO.
         02 LINE 11 COLUMN 25 VALUE "  4 KAYIT SILME          "
          REVERSE-VIDEO.
         02 LINE 12 COLUMN 25 VALUE "  5 BASKA DOSYAYA AKTARMA"
          REVERSE-VIDEO.
         02 LINE 13 COLUMN 25 VALUE "  6 ODEME                "
          REVERSE-VIDEO.
         02 LINE 14 COLUMN 25 VALUE "  7 CIKIS                "
          REVERSE-VIDEO.
         02 LINE 16 COLUMN 25 VALUE "SECIMINIZ................"
          REVERSE-VIDEO.
       01 KAYIT-GIRISI.
         02 BLANK SCREEN.
         02 LINE  1 COLUMN 20 VALUE " KURSIYER KAYDI " REVERSE-VIDEO.
         02 LINE  7 COLUMN 5 VALUE " NO " REVERSE-VIDEO.
         02 LINE  8 COLUMN 5 VALUE " ADI SOYADI     " REVERSE-VIDEO.
         02 LINE  9 COLUMN 5 VALUE " BABA ADI       " REVERSE-VIDEO.
         02 LINE 10 COLUMN 5 VALUE " ANNE ADI       " REVERSE-VIDEO.
         02 LINE 11 COLUMN 5 VALUE " DOGUM YERI     " REVERSE-VIDEO.
         02 LINE 12 COLUMN 5 VALUE " DOGUM TARIHI   " REVERSE-VIDEO.
         02 LINE 13 COLUMN 5 VALUE " ILI            " REVERSE-VIDEO.
         02 LINE 14 COLUMN 5 VALUE " ILCESI         " REVERSE-VIDEO.
         02 LINE 15 COLUMN 5 VALUE " KOY-MAHALLESI  " REVERSE-VIDEO.
         02 LINE 16 COLUMN 5 VALUE " CILT NO        " REVERSE-VIDEO.
         02 LINE 17 COLUMN 3 VALUE " EV ADRESI      " REVERSE-VIDEO.
         02 LINE 18 COLUMN 3 VALUE " EV TELEFONU    " REVERSE-VIDEO.
         02 LINE  7 COLUMN 15 VALUE " SAYFA NO " REVERSE-VIDEO.
         02 LINE  7 COLUMN 30 VALUE " SIRA NO " REVERSE-VIDEO.
         02 LINE  8 COLUMN 47 VALUE " VERILIS TARIHI " REVERSE-VIDEO.
         02 LINE  9 COLUMN 47 VALUE " VER.NUF.IDRESI " REVERSE-VIDEO.
         02 LINE 10 COLUMN 47 VALUE " DIGER BILGILER " REVERSE-VIDEO.
         02 LINE 12 COLUMN 47 VALUE " TAHSIL DURUMU  " REVERSE-VIDEO.
         02 LINE 13 COLUMN 47 VALUE " DOKTOR RAPORU  " REVERSE-VIDEO.
         02 LINE 14 COLUMN 47 VALUE " ONCEKI BEL.CIN " REVERSE-VIDEO.
         02 LINE 15 COLUMN 47 VALUE " ISTED. BEL.CIN " REVERSE-VIDEO.
         02 LINE 16 COLUMN 47 VALUE " ODEME          " REVERSE-VIDEO.
         02 LINE 17 COLUMN 42 VALUE " IS ADRESI      " REVERSE-VIDEO.
         02 LINE 18 COLUMN 42 VALUE " IS TELEFONU    " REVERSE-VIDEO.
       01 TEKRAR-EKRANI.
         02 LINE 20 COLUMN 20 VALUE "T" HIGHLIGHT.
         02 LINE 20 COLUMN 21 VALUE "EKRAR" .
         02 LINE 20 COLUMN 28 VALUE "M" HIGHLIGHT.
         02 LINE 20 COLUMN 29 VALUE "ENU" .
       01 KAYIT-ARAMA.
         02 BLANK SCREEN.
         02 LINE 10 COLUMN 20 VALUE "SIGORTA NO    =" REVERSE-VIDEO.
       01 ARANAN.
         02 LINE 11 COLUMN 20 VALUE "ADI SOYADI    =" HIGHLIGHT.
         02 LINE 12 COLUMN 20 VALUE "DOGUM YERI    =" HIGHLIGHT.
         02 LINE 13 COLUMN 20 VALUE "DOGUM TARIHI  =" HIGHLIGHT.
         02 LINE 14 COLUMN 20 VALUE "BASLAMA TARIHI=" HIGHLIGHT.
         02 LINE 15 COLUMN 20 VALUE "PRIM TOPLAMI  =" HIGHLIGHT.
         02 LINE 18 COLUMN 20 VALUE "BIR TUSA BASINIZ." REVERSE-VIDEO.
       01 EKRANA-LISTE.
         02 BLANK SCREEN.
         02 LINE 1 COLUMN 1 VALUE "SIGORTA NO".
         02 LINE 1 COLUMN 15 VALUE "ADI SOYADI".
         02 LINE 1 COLUMN 35 VALUE "B. TARIHI".
         02 LINE 1 COLUMN 45 VALUE "PRIM TOPLAMI".
         02 LINE 1 COLUMN 60 VALUE "DOGUM YERI".
       01 DUZELTME.
         02 LINE 11 COLUMN 20 VALUE "1-ADI SOYADI    =" REVERSE-VIDEO.
         02 LINE 12 COLUMN 20 VALUE "2-DOGUM YERI    =" REVERSE-VIDEO.
         02 LINE 13 COLUMN 20 VALUE "3-DOGUM TARIHI  =" REVERSE-VIDEO.
         02 LINE 14 COLUMN 20 VALUE "4-BASLAMA TARIHI=" REVERSE-VIDEO.
         02 LINE 15 COLUMN 20 VALUE "5-PRIM TOPLAMI  =" REVERSE-VIDEO.
         02 LINE 16 COLUMN 20 VALUE
          "DUZELTILECEK KAYITNUMARASINI GIRIN" HIGHLIGHT.
       01 YILLIK-LISTE.
         02 LINE 12 COLUMN 30 VALUE
         "LISTELENECEK YIL=" REVERSE-VIDEO.
       PROCEDURE DIVISION.
       BASLA.
           OPEN I-O SIGORTA.
           IF FST = "30" OPEN OUTPUT SIGORTA CLOSE SIGORTA
           OPEN I-O SIGORTA.
       MENU.
           DISPLAY ANA-MENU.
           ACCEPT(16, 43) TUSAUTO-SKIP.
           IF TUS = "1" GO KAYITI.
       CIKIS.
           CLOSE SIGORTA YAZICI.
           DISPLAY(1, 1) ERASE.
           STOP RUN.
       KAYITI.
           DISPLAY KAYIT-GIRISI.
           ACCEPT(7, 11) NUMARA WITH PROMPT.
           ACCEPT(8, 28) ISIM WITH PROMPT.
           ACCEPT(9, 28) BADI WITH PROMPT.
           ACCEPT(10, 28) AADI WITH PROMPT.
           ACCEPT(11, 28) DYERI WITH PROMPT.
           ACCEPT(12, 28) DTAR WITH PROMPT.
           ACCEPT(13, 28) ILI WITH PROMPT.
           ACCEPT(14, 28) ILCE WITH PROMPT.
           ACCEPT(15, 28) KMAH WITH PROMPT.
           ACCEPT(16, 28) CNO WITH PROMPT.
           ACCEPT(17, 28) EVAD WITH PROMPT.
           ACCEPT(18, 28) EVTEL WITH PROMPT.
           ACCEPT(7, 26) SNO WITH PROMPT.
           ACCEPT(7, 37) SAYNO WITH PROMPT.
           ACCEPT(8, 60) VTAR WITH PROMPT.
           ACCEPT(9, 60) VNUFID WITH PROMPT.
           ACCEPT(11, 60) TAHDUR WITH PROMPT.
           ACCEPT(12, 60) DRAP WITH PROMPT.
           ACCEPT(13, 60) ONBELC WITH PROMPT.
           ACCEPT(14, 60) ISBELC WITH PROMPT.
           ACCEPT(15, 60) ODEME WITH PROMPT.
           ACCEPT(16, 58) ISADR WITH PROMPT.
           ACCEPT(17, 58) ISTEL WITH PROMPT.
           DISPLAY (20,24) "HATA VAR MI? ".
           ACCEPT(20, 38) TUS WITH AUTO-SKIP.
           WRITE KAYIT INVALID KEY DISPLAY(21, 20) "CIFT KAYIT"
           ACCEPT(21, 35) TUS WITH AUTO-SKIP.
           GO TEN.
       TEN.
           DISPLAY TEKRAR-EKRANI.
           ACCEPT(20, 34) TUS WITH AUTO-SKIP.
           IF TUS = "M" GO MENU.
           IF TUS = "T" GO KAYITI.
           GO TEN.
       ARAMA.
           DISPLAY KAYIT-ARAMA.
           ACCEPT(10, 35) NUMARA WITH PROMPT.
           READ SIGORTA INVALID KEY DISPLAY(18, 20) "KAYIT BULUNAMADI"
           ACCEPT (18, 40) TUS WITH PROMPT  GO MENU.
           DISPLAY ARANAN.
           DISPLAY(11, 35) AD.
           DISPLAY(12, 35) YER.
           DISPLAY(13, 35) DTAR.
           MOVE BTAR TO TARIH.
           DISPLAY(14, 35) TARIH.
           DISPLAY(15, 35) TOPLAM.
           ACCEPT(18, 39) TUS WITH AUTO-SKIP.
           GO MENU.
       EKRAN.
           MOVE ZERO TO NUMARA.
           START SIGORTA KEY IS NOT LESS NUMARA
              INVALID KEY DISPLAY(18, 20) "KAYIT YOK" GO MENU.
       LISTE.
           DISPLAY EKRANA-LISTE.
           DISPLAY(2, 1) CIZGI.
           MOVE 3 TO LIN.
       OKU.
           READ SIGORTA NEXT AT END GO SON.
           MOVE BTAR TO TARIH.
           DISPLAY(LIN, 1) NUMARA.
           DISPLAY(LIN, 15) AD.
           DISPLAY(LIN, 35) TARIH.
           DISPLAY(LIN, 45) TOPLAM.
           DISPLAY(LIN, 60) YER.
           ADD 1 TO LIN.
           IF LIN NOT = 22 GO OKU.
           DISPLAY(24, 1)
           "SAYFA DOLDU.DIGER SAYFA ICIN BIR TUSA BASINIZ.".
           ACCEPT(24, 47) TUS WITH AUTO-SKIP.
           GO LISTE.
       SON.
           DISPLAY(24, 1)
           "LISTELEME SONA ERDI.MENUYE DONMEK ICIN BIR TUSA BASINIZ".
           ACCEPT(24, 60) TUS WITH AUTO-SKIP.
           GO MENU.
       DUZELT.
           DISPLAY KAYIT-ARAMA.
           ACCEPT(10, 35) NUMARA WITH PROMPT.
           READ SIGORTA INVALID KEY DISPLAY(18, 20) "KAYIT BULUNAMADI"
           ACCEPT (18, 40) TUS WITH PROMPT  GO MENU.
       DUZEL.
           DISPLAY DUZELTME.
           DISPLAY(11, 35) AD.
           DISPLAY(12, 35) YER.
           DISPLAY(13, 35) DTAR.
           MOVE BTAR TO TARIH.
           DISPLAY(14, 35) TARIH.
           DISPLAY(15, 35) TOPLAM.
           ACCEPT(16, 44) S WITH AUTO-SKIP.
           IF S = 1 PERFORM D1 GO DUZEL.
           IF S = 2 PERFORM D2 GO DUZEL.
           IF S = 3 PERFORM D3 GO DUZEL.
           IF S = 4 PERFORM D4 GO DUZEL.
           IF S = 5 PERFORM D5 GO DUZEL.
           IF S = 9 REWRITE KAYIT INVALID KEY
           DISPLAY(24, 20) "DISKETE YAZAMIYORUM".
           ACCEPT(18, 39) TUS WITH AUTO-SKIP.
           GO MENU.
       D1.
           DISPLAY(11, 35) "                    ".
           ACCEPT(11, 35) AD WITH PROMPT.
       D2.
           DISPLAY(12, 35) "               ".
           ACCEPT(12, 35) YER WITH PROMPT.
       D3.
           DISPLAY(13, 35) "          ".
           ACCEPT(13, 35) DTAR WITH PROMPT.
       D4.
           DISPLAY(14, 35) "  ".
           ACCEPT(14, 35) GUN WITH PROMPT.
           DISPLAY(14, 37) "  ".
           ACCEPT(14, 37) AY WITH PROMPT.
           DISPLAY(14, 39) "  ".
           ACCEPT(14, 39) YIL WITH PROMPT.
       D5.
           DISPLAY(15, 35) "            ".
           ACCEPT(15, 35) TOPLAM WITH PROMPT.
       YAZI.
           DISPLAY(1, 1) ERASE.
           MOVE ZERO TO NUMARA.
           START SIGORTA KEY IS NOT LESS NUMARA INVALID KEY
             DISPLAY(12, 20) "DOSYA BOS.BIR TUSA BAS."
             ACCEPT(12, 43) TUS WITH AUTO-SKIP GO MENU.
           WRITE SATIR FROM BASLIK.
           WRITE SATIR FROM CIZGI.
       OKUMA.
           READ SIGORTA NEXT AT END
             DISPLAY(1, 1) ERASE
             DISPLAY(12, 20) "DOSYA BITTI.BIR TUSA BAS."
             ACCEPT(12, 47) TUS WITH AUTO-SKIP GO MENU.
           MOVE NUMARA TO SAYI.
           MOVE AD TO ADI.
           MOVE BTAR TO BAS.
           MOVE TOPLAM TO PRIM.
           WRITE SATIR FROM YAZ.
           GO OKUMA.
       YILLIK.
           DISPLAY(1, 1) ERASE.
           DISPLAY YILLIK-LISTE.
           ACCEPT(12, 48) SENE WITH PROMPT.
           IF SENE = 00 GO YILLIK.
           MOVE ZERO TO NUMARA.
           START SIGORTA KEY IS NUMARA INVALID KEY
             DISPLAY(16, 20) "DOSYA BOS.BIR TUSA BAS."
              ACCEPT(16, 44) TUS WITH AUTO-SKIP GO MENU.
       BASLIK-AT.
           DISPLAY EKRANA-LISTE.
           DISPLAY(2, 1) CIZGI.
           MOVE 3 TO LIN.
       OKUL.
           READ SIGORTA NEXT AT END GO BEKLE.
           IF YIL NOT = SENE GO OKUL.
           MOVE BTAR TO TARIH.
           DISPLAY(LIN, 1) NUMARA.
           DISPLAY(LIN, 15) AD.
           DISPLAY(LIN, 35) TARIH.
           DISPLAY(LIN, 45) TOPLAM.
           DISPLAY(LIN, 60) YER.
           ADD 1 TO LIN.
           IF LIN NOT = 22 GO OKU.
           DISPLAY(24, 1)
           "SAYFA DOLDU.DIGER SAYFA ICIN BIR TUSA BASINIZ.".
           ACCEPT(24, 46) TUS WITH AUTO-SKIP.
           GO BASLIK-AT.
       BEKLE.
           DISPLAY(24, 1)
            "KAYIT BITTI.MEUYE DONMEK ICIN BIR TUSA BASINIZ.".
            ACCEPT(24, 45) TUS WITH PROMPT.
           GO MENU.
       ODEME.
           DISPLAY KAYIT-ARAMA.
           ACCEPT(10, 35) NUMARA WITH PROMPT.
           READ SIGORTA INVALID KEY DISPLAY(18, 20) "KAYIT BULUNAMADI"
           ACCEPT (18, 40) TUS WITH PROMPT  GO MENU.
           DISPLAY ARANAN.
           DISPLAY(11, 35) AD.
           DISPLAY(12, 35) YER.
           DISPLAY(13, 35) DTAR.
           MOVE BTAR TO TARIH.
           DISPLAY(14, 35) TARIH.
           DISPLAY(15, 35) TOPLAM.
           DISPLAY(16, 20) "ODEDIGI MIKTAR=".
           ACCEPT(16, 36) YENI WITH PROMPT.
           COMPUTE TOPLAM = YENI + TOPLAM.
           REWRITE KAYIT INVALID KEY
             DISPLAY(24, 20) "DISKETE YAZAMIYORUM".
       DEVAMMI.
           DISPLAY(18, 20) "DEVAM E/H".
           ACCEPT(18, 29) TUS WITH AUTO-SKIP.
           IF TUS = "E" GO ODEME.
           GO MENU.